import 'dart:ui';
import 'package:flutter/material.dart';
import 'dart:math';
import 'package:firebase_core/firebase_core.dart';
import 'firebase_options.dart';
import 'package:firebase_analytics/firebase_analytics.dart';

Future main() async {
  WidgetsFlutterBinding.ensureInitialized();
  await Firebase.initializeApp(
    options: DefaultFirebaseOptions.currentPlatform,
  );
  try {
    await FirebaseAnalytics.instance.logAppOpen();
  } catch (e) {
    print('Ошибка при отправке события аналитики: $e');
  }

  runApp(MyApp());
}

class MyApp extends StatelessWidget {

  final FirebaseAnalytics analytics = FirebaseAnalytics.instance;

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'Steel Grade Wordle - ГОСТ',
      theme: ThemeData(
        primaryColor:
            const Color.fromARGB(255, 245, 222, 165), // Цвет старой бумаги
        scaffoldBackgroundColor: const Color.fromARGB(255, 245, 222, 165),
        textTheme: const TextTheme(
          bodyLarge: TextStyle(
            fontFamily: 'Courier',
            color: Colors.black87,
          ),
          bodyMedium: TextStyle(
            fontFamily: 'Courier',
            color: Colors.black87,
          ),
          titleLarge: TextStyle(
            fontFamily: 'Courier',
            fontWeight: FontWeight.bold,
            color: Colors.black87,
          ),
        ),
      ),
      home: WordleGame(),
      navigatorObservers: [
        FirebaseAnalyticsObserver(analytics: analytics),
      ],
    );
  }
}

class WordleGame extends StatefulWidget {
  const WordleGame({super.key});

  @override
  _WordleGameState createState() => _WordleGameState();
}

class _WordleGameState extends State<WordleGame> {
  final Map<String, String> steelGrades = {
    "15К":
        "фланцы, днища, цельнокованые и сварные барабаны паровых котлов, корпуса аппаратов и другие детали котлостроения и сосудов, работающие под давлением при температуре до 450 °С.",
    "18К":
        "деталей и частей котлов, сосудов, работающих под давлением при комнатной, повышенной и пониженной температурах.",
    "30":
        "тяги, серьги, траверсы, рычаги, валы, звездочки, шпиндели, цилиндры прессов, соединительные муфты и другие детали невысокой прочности.",
    "50":
        "зубчатые колеса, прокатные валки, штоки, тяжелонагруженные валы, оси, бандажи, малонагруженные пружины и рессоры, лемехи, пальцы звеньев гусениц, муфты сцепления коробок передач, корпуса форсунок и другие детали, работающие на трение.",
    "8":
        "детали, к которым предъявляются требования высокой пластичности: шайбы, патрубки, прокладки и другие неответственные детали, работающие в интервале температур от —40 до 450 °С.",
    "08Ю":
        "детали, изготовляемые холодной штамповкой с особо сложной и сложной вытяжкой",
    "35":
        "детали невысокой прочности, испытывающие небольшие напряжения: оси, цилиндры, коленчатые валы, шатуны, шпиндели, звездочки, тяги, ободы, траверсы, валы, бандажи, диски и другие детали",
    "55":
        "зубчатые колеса, прокатные валки, штоки, тяжелонагруженные валы, оси, бандажи, малонагруженные пружины и рессоры, лемехи, пальцы звеньев гусениц и муфты сцепления коробок передач, корпуса форсунок и другие детали, работающие на трение.",
    "10":
        "штамповки, поковки,трубопроводы котлов высокого давления и другие детали с весьма длительным сроком службы при температурах до 350 град.",
    "20":
        "трубы перегревателей, коллекторов и трубопроводов котлов высокого давления, листы для штампованных деталей, цементуемые детали для длительной и весьма длительной службы при температурах до 350 град.",
    "22К":
        "днища, фланцы, цельнокованые и сварные барабаны паровых котлов. полумуфты, патрубки и другие детали, работающие при температуре от —40 до 450 °С под давлением.",
    "40":
        "трубы, поковки, крепежные детали, валы, диски, роторы, фланцы, зубчатые колеса, втулки для длительной и весьма длительной службы при температурах до 425 град.",
    "58":
        "детали с тонкими сечениями упрочняемых элементов: шестерни среднего модуля, втулки, пластины и другие детали; после поверхностного упрочнения с нагревом ТВЧ — детали, к которым предъявляются требования высокой износостойкости при вязкой сердцевине, работающие при больших скоростях и средних удельных давлениях.",
    "15":
        "болты, винты, крюки и другие детали, к которым предъявляются требования высокой пластичности и работающие при температуре от —40 до 450 °С; после ХТО—рычаги, кулачки, гайки и другие детали, к которым предъявляются требования высокой поверхностной твердости и невысокой прочности сердцевины.",
    "16К":
        "детали и части котлов, сосудов, работающих под давлением при комнатной, повышенной и пониженной температурах.",
    "20К":
        "фланцы, днища, цельнокованые и сварные барабаны паровых котлов, полумуфты, корпуса аппаратов и другие детали котлостроения и сосудов, работающие под давлением и при температуре до 450 °С.",
    "25":
        "оси, валы, соединительные муфты, собачки, рычаги, вилки, шайбы, валики, болты, фланцы, тройники, крепежные детали и другие неответственные детали; после ХТО — винты, втулки, собачки и другие детали, к которым предъявляются требования высокой поверхностной твердости и износостойкости при невысокой прочности сердцевины.",
    "45":
        "вал-шестерни, коленчатые и распределительные валы, шестерни, шпиндели, бандажи, цилиндры, кулачки и другие нормализованные, улучшаемые и подвергаемые поверхностной термообработке детали, от которых требуется повышенная прочность.",
    "60":
        "цельнокатаные колеса вагонов, валки рабочие листовых станов для горячей прокатки металлов, шпиндели, бандажи, диски сцепления, пружинные кольца амортизаторов, замочные шайбы, регулировочные шайбы, регулировочные прокладки и другие детали, к которым предъявляются требования высокой прочности и износостойкости.",
    "У10":
        "инструмент, работающий в условиях, не вызывающих разогрева режущей кромки: метчики ручные, рашпили, надфили, пилы для обработки древесины, матрицы для холодной штамповки, гладкие калибры, топоры.",
    "У12":
        "режущие инструменты, работающие в условиях, не вызывающих разогрева режущей кромки: метчики ручные, метчики машинные мелкоразмерные, плашки для круппов, развертки мелкоразмерные, надфили, измерительный инструмент простой формы: гладкие калибры, скобы.",
    "У7":
        "инструмент, который работает в условиях, не вызывающих разогрева рабочей кромки: зубила, долота, бородки, молотки, лезвия ножниц для резки металла, топоры, колуны, стамески, плоскогубцы комбинированные, кувалды.",
    "У8Г": "для производства пружинной ленты",
    "05Х12Н6Д2МФСГТ":
        "для инструмента формообразующих деталей пресс-форм формования резинотехнических и пластмассовых изделий",
    "13Х":
        "для бритвенных ножей и лезвий, острого хирургического инструмента, шаберов, гравировального инструмента",
    "5ХВ2СФ":
        "ножи для холодной резки металла, резьбонакатные плашки, пуансоны и обжимные матрицы при холодной работе;деревообделочные инструменты при длительной работе",
    "6Х4М2ФС":
        "для вырубного и высадочного инструмента (штампов, пуасонов, пневматических зубил и др.), накатного инструмента",
    "8Х6НФТ":
        "для ножей, применяемых для фрезерования древесины, строгальных пил и других деревообрабатывающих инструментов",
    "9Х5ВФ":
        "для ножей, применяемых для фрезерования древесины, строгальных пил и других деревообрабатывающих инструментов",
    "9ХФМ": "дисковые и рамные деревообрабатывающие пилы",
    "ХВ4Ф":
        "резцы и фрезы при обработке с небольшой скоростью резания твердых металлов (валки с закаленной поверхностью), гравировальные резцы при очень напряженной работе, прошивные пуансоны и т. д",
    "ХГС":
        "для валков холодной прокатки, холодновысадочных матриц и пуасонов, вырубных штампов небольших размеров",
    "45ХНМ":
        "оси составных опорных валков листовых станов для горячей прокатки металлов, шестеренные валы и другие.",
    "60ХН":
        "рабочие валки блюмингов, слябингов, заготовочных, рельсобалочных и крупносортных станов, рабочие опорные валки листовых станов для горячей прокатки металлов.",
    "75ХСМФ": "рабочие валки листовых станов для холодной прокатки металлов.",
    "9Х2":
        "рабочие и опорные валки двух- и четырехвалковых клетей листовых станов для холодной прокатки металлов. Рабочие и опорные кованые валки листовых станов для горячей прокатки металлов.",
    "27Х2Н2М1Ф":
        "ответственные детали прессового инструмента с повышенными свойствами прочности и повышенной пластичностью после нормализации и отпуска: втулки контейнеров, кольца, пресс-штемпели, иглы и другие детали, работающие при высоких температурах",
    "3Х3М3Ф":
        "инструмент горячего деформирования на кривошипных прессах и гориэонтально-ковочннх машинах, подвергающийся в процессе работы интенсивному охлаждению (как правило, для мелкого инструмента), пресс-формы литья под давлением медных сплавов, ножи для горячей резки, охлаждаемые водой.",
    "4Х3ВМФ":
        "для мелких молотовых штампов, молотовых и прессовых вставок (толщиной или диаметром от 300 0-400 мм), инструмента горизонтальноковочных машин при горячем деформировании конструкционных и жаропрочных сталей; инструмента для высокоскоростной машинной штамповки конструкционных сталей",
    "4Х5МФС":
        "мелкие молотовые штампы, крупные (сечением более 200 мм) молотовые и прессовые вставки при горячем деформировании конструкционных сталей и цветных сплавов в условиях крупносерийного и массового производства, пресс-формы литья под давлением алюминиевых, а также цинковых и магниевых сплавов.",
    "5Х3В3МФС":
        "для тяжелонагруженного прессового инструмента ( матриц, прошивных и формующих пуансонов и т.п.); инструмента для высадки на горизонтальноковочных машинах и вставок штампов напряженных конструкций, для горячего объемного деформирования легированых конструкционных сталей и жаропрочных сплавов при горячем деформировании легированных конструкционных сталей и жаропрочных сплавов",
    "6ХВ2С":
        "ножи для холодной резки металла, резьбонакатные плашки, пуансоны и обжимные матрицы при холодной работе, штампы сложной формы, работающие с повышенными ударными нагрузками.",
    "7ХГ2ВМ":
        "для изготовления штампов холодного объемного деформирования, используемых при производстве изделий из цветных сплавов и малопрочных конструкционных сталей; пуансонов, матриц вырубных штампов сложной конфигурации",
    "Х12":
        "холодные штампы высокой устойчивости против истирания, не подвергающиеся сильным ударам и толчкам; волочильные доски, глазки для калибрования пруткового металла под накатку резьбы, гибочные и формовочные штампы, сложные секции кузовных штампов, матриц и пуансонов вырубных и просечных штампов, штамповки активной части электрических машин и т. д.",
    "Х12МФ":
        "профилировочные ролики сложных форм, секции кузовных штампов сложных форм, сложные дыропрошивные матрицы при формовке листового металла, эталонные шестерни, накатные плашки, волоки, матрицы и пуансоны вырубных просечных штампов со сложней конфигурацией рабочих частей, штамповки активной части электрических машин.",
    "11М5Ф": "для изготовления инструмента",
    "Р12":
        "для всех видов режущего инструмента при обработке углеродистых легированных конструкционных сталей",
    "Р18К5Ф2":
        "для черновых и получерновых инструментов при обработке высокопрочных, нержавеющих и жаропрочных сталей и сплавов",
    "Р2М5": "для изготовления инструмента",
    "Р6М5Ф3":
        "для чистовых и получистовых инструментов при обработке нелегированных и легированных конструкционных сталей",
    "Р9М4К8":
        "для обработки высокопрочных нержавеющих и жаропрочных сталей и сплавов в условиях повышенного разогрева режущей кромки: зуборезный инструмент, фрезы, фасонные резцы, зенкеры, метчики.",
    "У10А":
        "инструмент, работающий в условиях, не вызывающих разогрева режущей кромки: метчики ручные, рашпили, надфили, пилы для обработки древесины, матрицы для холодной штамповки, гладкие калибры, топоры.",
    "У12А":
        "режущие инструменты, работающие в условиях, не вызывающих разогрева режущей кромки: метчики ручные, метчики машинные мелкоразмерные, плашки для круппов, развертки мелкоразмерные, надфили, измерительный инструмент простой формы: гладкие калибры, скобы.",
    "У7А":
        "инструмент, который работает в условиях, не вызывающих разогрева рабочей кромки: зубила, долота, бородки, молотки, лезвия ножниц для резки металла, топоры, колуны, стамески, плоскогубцы комбинированные, кувалды.",
    "У8ГА": "для производства пружинной ленты",
    "11Х4В2МФ3С2":
        "для вырубных штампов, пуасонов и матриц холодновысадочных автоматов, пуасонов и выталкивателей для холодного выдавливания, эксплуатируемых с удельными давлениями 0-2000 МПа в условиях повышенного изнашивания и нагрева рабочих поверхностей 0-400 град.С; шлице- и резьбонакатного инструмента",
    "3Х2МНФ":
        "крупные молотовые штампы; штампы-контейнеры; кольца-бандажи; крупные внутренние втулки",
    "5ХНВ":
        "для молотовых штампов паровоздушных и пневматических молотов с массой падающих частей 0-3 тонн",
    "6Х6В3МФС":
        "для резьбонакатных роликов, зубонакатников,обрезных матриц и др. инструментов, приедназначенных для холодной пластической деформации металлов повышенной твердости; ножей труборазрубочных машин, ножей гильотинных ножниц для резки высокопрочных сталей и сплавов; рубильных ножей, применяемых в деревообрабатывающей промышленнности; шарошек для разрушения горных пород и других аналогичных инструментов",
    "8ХФ":
        "для штемпелей при холодной работе; ножей при холодной резке металла, обрезных матриц и пуассонов при холодной обрезке заусенцев; кернеров",
    "9ХВГ":
        "резьбовые калибры, лекала сложной формы, сложные весьма точные штампы для холодных работ, которые при закалке не должны подвергаться значительным объемным изменениям и короблению.",
    "В2Ф": "для ленточных пил по металлу и ножовочных полотен",
    "ХВГ":
        "измерительный и режущий инструмент, для которого повышенное коробление при закалке недопустимо, резьбовые калибры, протяжки, длинные метчики, длинные развертки и другой вид специального инструмента, холодновысадочные матрицы и пуансоны, технологическая оснастка.",
    "55Х":
        "оси составных опорных валков для холодной прокатки металлов. Рабочие валки блюмингов, слябингов, заготовочных, рельсобалочных, крупносортных, среднесортных и мелкосортных станов и рабочие валки листовых станов для горячей прокатки металлов. Редукторные валы, шестерни и другие нагруженные детали, подвергающиеся истиранию, но работающие без значительных ударных нагрузок.",
    "60ХСМФ":
        "рабочие валки двух - и четырехвалковых клетей листовых станов для холодной прокатки металлов.",
    "7Х2СМФ": "рабочие валки кованые для холодной прокатки металлов.",
    "9Х2МФ":
        "рабочие валки для станов холодной прокатки металлов при особо тяжелых условиях эксплуатации, рабочие валки проволочных обжимных и сортовых станов",
    "2Х6В8М2К8":
        "иглы, пуансоны для прессования жаропрочных и коррозионно-стойких сталей и сплавов, а также титановых сплавов при температурах 0-650-675 град.С, выполняемых без интенсивного охлаждения",
    "40Х5МФ":
        "ответственные детали прессового и штампового инструмента с высокими свойствами прочности после нормализации и отпуска: втулки контейнеров, кольца, пресс-штемпели, иглы и другие детали, работающие при температурах 0-500 °С.",
    "4Х4ВМФС":
        "для инструмента высокоскоростной машинной штамповки, высадки на горизонтальноковочных машинах; вставок штампов для горячего деформирования легированых конструкционных сталей и жаропрочных сплавов на молотах и кривошипных прессах; пресс-форм литья под давлением медных сплавов",
    "4ХВ2С":
        "пневматический инструмент: зубила, обжимки, вырубные и обрезные штампы сложной формы, работающие с повышенными ударными нагрузками.",
    "5ХВ2С":
        "ножи при холодной резке металла, резьбонакатные плашки, пуансоны и обжимные матрицы при холодной работе, штампы сложной формы, работающие с повышенными ударными нагрузками.",
    "6ХВГ":
        "пуансоны сложной формы для холодной прошивки преимущественно фигурных отверстий в листовом и полосовом материале, небольшие штампы для горячей штамповки, главным образом, когда требуется минимальное изменение размеров при закалке.",
    "7ХГ2ВМФ":
        "штампы объемного холодного деформирования и вырубной инструмент сложной конфигурации, используемые при производстве изделий из цветных сплавов и малопрочных конструкционных сталей.",
    "Х12ВМ":
        "холодные штампы высокой устойчивости против истирания, не подвергающиеся сильным ударам и толчкам, волочильные доски и волоки, глазки для калибрования пруткового металла под накатку резьбы, гибочные и формовочные штампы, сложные кузовные штампы, матрицы и пуансоны вырубных и просечных штампов, штамповки активной части электрических машин,",
    "Х12Ф1":
        "профилировочные ролики сложной формы, эталонные шестерни, накатные плашки, волоки, секции кузовных штампов сложной формы, сложные дыропрошивные матрицы при формовке листового металла, матрице и пуансоны вырубных и просечных штампов со сложной конфигурацией рабочих частей, пуансоны и матрицы холодного выдавливания, работающие при давлении 0-1400—1600 МПа.",
    "11Р3АМ3Ф2":
        "для инструмента простой формы при обработке углеродистых и малолегированных сталей",
    "Р12Ф3":
        "для чистовых инструментов при обработке вязкой аустенитной стали и материалов, обладающих абразивными свойствами",
    "Р18Ф2":
        "для изготовления чистовых и получистовых режущих инструментов при обработке среднелегированных конструкционных сталей",
    "Р6М3":
        "для изготовления чистовых и получистовых инструментов небольших размеров при обработке конструкционных сталей",
    "Р9":
        "для изготовления инструментов простой формы, не требующих большого объема шлифовки, для обработки обычных конструкционных материалов.",
    "Р9Ф5":
        "для изготовления инструментов простой формы, не требующих больших объемов шлифовальных операций при обработке материалов с повышенными абразивными свойствами; чистовых инструментов простой формы при обработке легированных сталей и сплавов",
    "У11":
        "для инструмента простой формы при обработке углеродистых и малолегированных сталей",
    "У13":
        "инструменты повышенной износостойкости, работающие при умеренных и значительных давлениях без разогрева режущей кромки",
    "У8":
        "для инструмента, работающего в условиях, не вызывающих разогрева режущей кромки: фрез, зенковок, топоров, стамесок, долот, пил продольных и дисковых, накатных роликов, кернеров, отверток, комбинированных плоскогубцев, боковых кусачек.",
    "У9":
        "инструмент, работающий в условиях, не вызывающих разогрева кромки: инструмент для обработки дерева, слесарно-монтажный инструмент, калибры простой формы и пониженных классов точности.",
    "11ХФ":
        "для метчиков и другого режущего инструмента диаметром 0-30 мм, закаливаемого с охлаждением в горячих средах",
    "4ХМНФС": "для молотовых штампов, бандажей и матриц",
    "5ХНВС":
        "для молотовых штампов паровоздушных и пневматических молотов с массой падающих частей 0-3 тонн",
    "7ХФ": "для изготовления деревообрабатывающих инструментов",
    "9Г2Ф": "для режущего и штамповочного инструмента",
    "9ХС":
        "сверла, развертки, метчики, плашки, гребенки, фрезы, машинные штампели, клейма для холодных работ. Ответственные детали, материал которых должен обладать повышенной износостойкостью, усталостной прочностью при изгибе, кручении, контактном нагружении, а также упругими свойствами.",
    "Х":
        "для зубил, применяемых при насечке напильников; очень твердых кулачков эксцентриков и пальцев; гладких цилиндрических калибров и калиберных колец; токарных, строгальных и долбежных резцов в лекальных и ремонтных мастерских",
    "ХВСГ":
        "для изготовления инструментов, предназначенных для ручной работы; холодновысадочных матриц и пуассонов; технологической оснастки; деревообрабатывающих инструментов; ножей для бумажной промышленности",
    "60Х2СМФ":
        "рабочие валки двух - и четырехвалковых клетей листовых станов для холодной прокатки металлов.",
    "75ХМ":
        "рабочие и опорные валки листовых станов для горячей прокатки черных металлов, опорные валки двух- и четырехвалковых клетей листовых станов для холодной прокатки металлов.",
    "90ХМФ":
        "опорные валки всех размеров и бандажи составных опорных валков листовых станов для горячей прокатки металлов.",
    "3Х2В8Ф":
        "тяжелонагруженный прессовый инструмент (мелкие вставки окончательного штампового ручья, матрицы и пуансоны для выдавливания и т. д.) при горячем деформировании легированных конструкционных сталей и жаропрочных сплавов, пресс-формы литья под давлением медных сплавов.",
    "4Х2В5МФ":
        "для тяжелонагруженного прессового инструмента (мелких вставок окончательного штампового ручья, мелких вставных знаков, матриц и пуансонов для выдавливания и т.п.) при горячем деформировании легированных конструкционных сталей и жаропрочных сплавов",
    "4Х5В2ФС":
        "пресс-формы литья под давлением цинковых, алюминиевых и магниевых сплавов, молотовые и прессовые вставки (сечением 0-200—250 мм) при горячем деформировании конструкционных сталей, инструмент для высадки заготовок из легированных конструкционных и жаропрочных материалов на горизонтально-ковочных машинах.",
    "4ХМФС":
        "молотовые штампы паровоздушных и пневматических молотов с массой падающих частей 0-3 т при деформации легированных конструкционных и нержавеющих сталей, прессовый инструмент для обработки алюминиевых сплавов, вставки и пуансоны для высадки на горизонтально-ковочных машинах.",
    "5ХГМ":
        "молотовые штампы паровоздушных и пневматических молотов с массой падающих частей 0-3 т, ковочные штампы для горячей штамповки, валки крупных, средних и мелкосортных станов для прокатки твердого металла.",
    "6ХС":
        "пневматические зубила и штампы небольших размеров для холодной штамповки, рубильные ножи.",
    "8Х3":
        "инструмент (пуансоны, матрицы) горячей высадки крепежа и заготовок из углеродистых и низколегированных конструкционных сталей на горизонтально-ковочных машинах, детали штампов (матрицы, пуансоны, выталкиватели) для горячего прессования и выдавливания, гибочные и просечные штампы",
    "Х12ВМФ":
        "холодные штампы высокой устойчивости против истирания, не подвергающиеся сильным ударам и толчкам; волочильные доски, глазки для калибрования пруткового металла под накатку резьбы, гибочные и формовочные штампы, сложные секции кузовных штампов, матриц и пуансонов вырубных и просечных штампов, штамповки активной части электрических машин и т. д.",
    "Х6ВФ":
        "резьбокатаный инструмент (ролики и плашки), ручные ножовочные полотна, бритвы, матрицы, пуансоны, зубонакатники и другие инструменты, предназначенные для холодной деформации, для дереворежущего фрезерного инструмента.",
    "9Х4М3Ф2АГСТ": "для изготовления инструмента",
    "Р14Ф4":
        "для изготовления инструментов простой формы, не требующих больших объемов шлифовальных операций при обработке материалов с повышенными абразивными свойствами; чистовых инструментов простой формы при обработке легированных сталей и сплавов",
    "Р18Ф2К5":
        "для изготовления получистовых и черновых инструментов при обработке углеродистых и легированных конструкционных сталей на повышенных режимах резания",
    "Р6М5":
        "для всех видов режущего инструмента при обработке углеродистых легированных конструкционных сталей; предпочтительно для изготовления резьбонарезного инструмента, а также инструмента, работающего с ударными нагрузками",
    "Р9К10":
        "для изготовления получистовых и черновых инструментов при обработке углеродистых и легированных конструкционных сталей на повышенных режимах резания",
    "У11А":
        "метчики ручные, рашпили, надфили, пилы для обработки древесины, матрицы для холодной штамповки, топоры, калибры простой формы и пониженных классов точности",
    "У13А":
        "инструменты повышенной износостойкости, работающие при умеренных и значительных давлениях без разогрева режущей кромки",
    "У8А":
        "для инструмента, работающего в условиях, не вызывающих разогрева режущей кромки: фрез, зенковок, топоров, стамесок, долот, пил продольных и дисковых, накатных роликов, кернеров, отверток, комбинированных плоскогубцев, боковых кусачек.",
    "У9А":
        "инструмент, работающий в условиях, не вызывающих разогрева кромки: инструмент для обработки дерева, слесарно-монтажный инструмент, калибры простой формы и пониженных классов точности.",
    "12Х1": "для измерительного инструмента (плиток, калибров, шаблонов)",
    "4ХС":
        "для зубил, обжимок, ножниц при холодной и горячей резке металла; штампов горячей вытяжки",
    "6Х3МФС":
        "для пуассонов, работающих с повышенными динамическими нагрузками; для холодновысадочных штампов, штемпелей, клейм; чеканочных штампов и некоторых слесарно-монтажных инструментов",
    "8Х4В2МФС2":
        "для матриц и пуасонов штампов холодного объемного деформирования, испытывающих в процессе эксплуатации давление 0-2300 МПа, резьбонакатных роликов",
    "9Х1":
        "рабочие и опорные валки для холодной прокатки металлов. Рабочие валки рельсобалочных, крупносортных и проволочных обжимных и сортовых станов для горячей прокатки металлов, подвергающиеся интенсивному износу и работающие в условиях минимальных или умеренных ударных нагрузок. Опорные составные валки листовых станов для горячей прокатки металла. Клейма, пробойники, холодновысадочные штампы, деревообрабатывающий инструмент и другие детали.",
    "9ХФ":
        "для рамных, ленточных, круглых строгальных пил; штемпелей при холодной работе; ножей при холодной резке металла, обрезных матриц и пуасонов при холодной обрезке заусенцев; кернеров",
    "ХВ4":
        "для прошивных пуассонов,инструментов для чистового резания твердых материалов с небольшой скоростью и граверных работ",
    "ХВСГФ": "для круглых плашек, разверток и другого режущего инструмента",
    "60ХГ":
        "рабочие валки штрипсовых и мелкосортных станов для горячей прокатки металлов.",
    "75ХМФ":
        "рабочие и опорные кованые валки листовых станов для горячей прокатки черных металлов.",
    "90ХФ":
        "рамные, ленточные, круглые пилы, ножи для холодной резки металла, обрезные матрицы и пуансоны холодной обрезки заусенцев, кернеры. Рабочие и опорные валки для холодной прокатки металла. Рабочие валки рельсобалочных, крупносортных и проволочных обжимных и сортовых станов для горячей прокатки металла, подвергающиеся интенсивному износу и работающие в условиях минимальных или умеренных ударных нагрузок. Рабочие валки, опорные валки и бандажи составных опорных валков листовых, обжимных и сортовых станов для горячей прокатки металла.",
    "3Х2Н2МВФ":
        "ответственные детали прессового инструмента с высокими свойствами прочности и удовлетворительной пластичностью после нормализации и отпуска: втулки контейнеров, пресс-штемпели, иглы и другие детали, работающие при повышенных температурах 0-500 °С.",
    "4Х2НМФ":
        "ковочные штампы с высотой кубика 0-700 мм для горячей штамповки деталей из труднодеформируемых материалов.",
    "4Х5МФ1С":
        "пресс-формы литья под давлением цинковых, алюминиевых и магниевых сплавов, молотовые и прессовые вставки (сечением 0-200—250 мм) при горячем деформировании конструкционных сталей, инструмент для высадки заготовок из легированных конструкционных и жаропрочных материалов на горизонтально-ковочных машинах.",
    "5Х2МНФ":
        "для крупногабаритных цельных штампов (диаметром 0-600 мм) для штамповки поковок из конструкционных сталей и жаропрочных сплавов на молотах и кривошипных прессах; зажимных и формующих вставок, наборных и формовочных пуасонов для высадки конструкционных сталей и жаропрочных сплавов на горизонтальноковочных машинах; ножей горячей резки",
    "5ХНМ":
        "молотовые штампы паровоздушных и пневматических молотов с массой падающих частей свыше 3 т, прессовые штампы и штампы машинной скоростной штамповки при горячем деформировании легких цветных сплавов, блоки матриц для вставок горизонтально-ковочных машин.",
    "7Х3":
        "инструмент (пуансоны, матрицы) горячей высадки крепежа и заготовок из углеродистых и низколегированных конструкционных сталей на горизонтально-ковочных машинах, детали штампов (матрицы, пуансоны, выталкиватели) для горячего прессования и выдавливания этих материалов на кривошипных прессах, гибочные, обрезные и просечные штампы.",
    "8Х4В3М3Ф2":
        "для изготовления резьбонакатных инструментов для холодной накатки, шлиценакатных роликов; деревообрабатывающих инструментов; ножей труборазрубочных прессов, гильотинных и других ножниц; пуансонов и матриц холодного объемного деформирования, эксплуатируемых с рабочими давлениями 0-2000-2100 мПа",
    "Х12М":
        "для изготовления накатных роликов, волочильных досок и волок, глазков для калибрования металла; матриц и пуансонов вырубных штампов; пуансонов и матриц холодного выдавливания, эксплуатируемых с рабочими давлениями 0-1400-1600 мПа",
    "Х6Ф4М": "для изготовления штампов",
    "Р10Ф5К5":
        "для изготовления получистовых и черновых инструментов при различных труднообрабатываемых материалов",
    "Р18":
        "резцы, сверла, фрезы, резьбовые фрезы, долбяки, развертки, зенкеры, метчики, протяжки для обработки конструкционных сталей с прочностью 0-1000 МПа, от которых требуется сохранение режущих свойств при нагревании во время работы",
    "Р2АМ9К5":
        "для режущих инструментов при обработке улучшенных легированных, а также нержавеющих сталей",
    "Р6М5К5":
        "для обработки высокопрочных нержавеющих и жаропрочных сталей и сплавов в условиях повышенного разогрева режущей кромки.",
    "Р9К5":
        "для обработки высокопрочных, нержавеющих и жаропрочных сталей и сплавов"
  };

  late String targetGrade;
  List<String> guesses = [];
  String currentGuess = '';
  int maxAttempts = 6;
  bool gameOver = false;
  int gamesPlayed = 0;
  int gamesWon = 0;

  @override
  void initState() {
    super.initState();
    startNewGame();
  }

  void startNewGame() {
    setState(() {
      targetGrade =
          steelGrades.keys.elementAt(Random().nextInt(steelGrades.length));
      guesses = [];
      currentGuess = '';
      gameOver = false;
    });
  }

  void makeGuess() {
    if (currentGuess.length != targetGrade.length) return;

    setState(() {
      guesses.add(currentGuess);
      if (currentGuess == targetGrade) {
        gameOver = true;
        gamesWon++;
        showWinDialog();
        gamesPlayed++;
      } else if (guesses.length >= maxAttempts) {
        gameOver = true;
        showLoseDialog();
        gamesPlayed++;
      }
      currentGuess = '';
    });
  }

  void showWinDialog() {
    showDialog(
      context: context,
      builder: (BuildContext context) {
        return AlertDialog(
          title: const Text('Поздравляем!'),
          content: Column(
            mainAxisSize: MainAxisSize.min,
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text('Вы угадали марку стали: $targetGrade'),
              const SizedBox(height: 10),
              const Text('Описание:',
                  style: TextStyle(fontWeight: FontWeight.bold)),
              Text(steelGrades[targetGrade]!),
            ],
          ),
          actions: <Widget>[
            TextButton(
              child: const Text('Новая игра'),
              onPressed: () {
                Navigator.of(context).pop();
                startNewGame();
              },
            ),
          ],
        );
      },
    );
  }

  void showLoseDialog() {
    showDialog(
      context: context,
      builder: (BuildContext context) {
        return AlertDialog(
          title: const Text('Игра окончена'),
          content: Column(
            mainAxisSize: MainAxisSize.min,
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text('Загаданная марка стали: $targetGrade'),
              const SizedBox(height: 10),
              const Text('Описание:',
                  style: TextStyle(fontWeight: FontWeight.bold)),
              Text(steelGrades[targetGrade]!),
            ],
          ),
          actions: <Widget>[
            TextButton(
              child: const Text('Новая игра'),
              onPressed: () {
                Navigator.of(context).pop();
                startNewGame();
              },
            ),
          ],
        );
      },
    );
  }

  void onCharacterPressed(String char) {
    if (!gameOver) {
      setState(() {
        // Добавляем setState для обновления UI
        if (char == '<' && currentGuess.isNotEmpty) {
          currentGuess = currentGuess.substring(0, currentGuess.length - 1);
        } else if (char != '<' && currentGuess.length < targetGrade.length) {
          currentGuess += char;
        }
      });
    }
  }

  Color getCharColor(String char, int index, String guess) {
    if (char == targetGrade[index]) {
      return const Color.fromARGB(
          255, 67, 122, 53); // Коричневый цвет для правильной позиции
    } else if (targetGrade.contains(char)) {
      return const Color.fromARGB(
          255, 223, 113, 2); // Светло-коричневый для правильной буквы
    }

    return const Color(0x83000096); // Бежевый для неправильной буквы
  }

  void showRulesDialog() {
    showDialog(
      context: context,
      builder: (BuildContext dialogContext) {
        return AlertDialog(
          title: const Text('Правила игры'),
          content: const SingleChildScrollView(
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                Text('1. Цель игры - угадать марку стали ГОСТ за 6 попыток.'),
                Text('2. После каждой попытки цвет букв изменится:'),
                Text('   - Зелёный: буква на правильной позиции'),
                Text('   - Жёлтый: буква есть в марке, но не на этой позиции'),
                Text('   - Серый: такой буквы в марке нет'),
                Text('3. Марка стали может содержать буквы и цифры.'),
                Text('4. Используйте клавиатуру на экране для ввода.'),
                Text('5. Нажмите "Подтвердить" после ввода каждой попытки.'),
                Text('6. Удачи!'),
              ],
            ),
          ),
          actions: <Widget>[
            TextButton(
              child: const Text('Закрыть'),
              onPressed: () => Navigator.of(dialogContext).pop(),
            ),
          ],
        );
      },
    );
  }

  void showStatisticsDialog() {
    showDialog(
      context: context,
      builder: (BuildContext context) {
        return AlertDialog(
          title: const Text('Статистика'),
          content: Column(
            mainAxisSize: MainAxisSize.min,
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text('Игр сыграно: $gamesPlayed'),
              Text('Игр выиграно: $gamesWon'),
              Text(
                  'Процент побед: ${gamesPlayed > 0 ? (gamesWon / gamesPlayed * 100).toStringAsFixed(1) : 0}%'),
            ],
          ),
          actions: <Widget>[
            TextButton(
              child: const Text('Закрыть'),
              onPressed: () => Navigator.of(context).pop(),
            ),
          ],
        );
      },
    );
  }

  void showSettingsDialog() {
    showDialog(
      context: context,
      builder: (BuildContext context) {
        return AlertDialog(
          title: const Text('Настройки'),
          content: const Text('Здесь будут настройки игры'),
          actions: <Widget>[
            TextButton(
              child: const Text('Закрыть'),
              onPressed: () => Navigator.of(context).pop(),
            ),
          ],
        );
      },
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Column(
        children: [
          Container(
            width: 210,
            height: 48,
            padding: const EdgeInsets.all(0),
            margin: const EdgeInsets.only(bottom: 30),
            // Add padding inside the container
            decoration: const BoxDecoration(
              borderRadius: BorderRadius.vertical(
                bottom: Radius.circular(20),
              ),
              border: Border(
                  bottom: BorderSide(color: Colors.deepOrangeAccent, width: 2),
                  left: BorderSide(color: Colors.deepOrangeAccent, width: 2),
                  right: BorderSide(color: Colors.deepOrangeAccent, width: 2)),
            ),
            child: Row(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                Expanded(
                  child: ListTile(
                    leading:
                        const Icon(Icons.rule, color: Colors.deepOrangeAccent),
                    onTap: showRulesDialog,
                  ),
                ),
                Expanded(
                  child: ListTile(
                    leading: const Icon(Icons.settings,
                        color: Colors.deepOrangeAccent),
                    onTap: showSettingsDialog,
                  ),
                ),
                Expanded(
                  child: ListTile(
                    leading: const Icon(Icons.bar_chart,
                        color: Colors.deepOrangeAccent),
                    onTap: showStatisticsDialog,
                  ),
                ),
              ],
            ),
          ),
          Expanded(
            child: ListView.builder(
              itemCount: maxAttempts,
              itemBuilder: (context, attemptIndex) {
                if (attemptIndex < guesses.length) {
                  return Row(
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: List.generate(targetGrade.length, (index) {
                      return Container(
                          width: 40,
                          height: 40,
                          margin: const EdgeInsets.only(bottom: 10),
                          decoration: BoxDecoration(
                            border: Border(
                              bottom: const BorderSide(
                                  color: Colors.deepOrangeAccent, width: 2),
                              top: const BorderSide(
                                  color: Colors.deepOrangeAccent, width: 2),
                              left: BorderSide(
                                  color: Colors.deepOrangeAccent,
                                  width: (index == 0) ? 2 : 0.5),
                              right: BorderSide(
                                  color: Colors.deepOrangeAccent,
                                  width: (index == targetGrade.length - 1)
                                      ? 2
                                      : 0.5),
                            ),
                            borderRadius: BorderRadius.horizontal(
                              left: Radius.circular((index == 0) ? 20 : 0),
                              right: Radius.circular(
                                  (index == targetGrade.length - 1) ? 20 : 0),
                            ),
                          ),
                          child: Center(
                            child: Text(
                              guesses[attemptIndex].split('')[index],
                              style: TextStyle(
                                fontWeight: FontWeight.bold,
                                color: getCharColor(
                                    guesses[attemptIndex].split('')[index],
                                    index,
                                    guesses[attemptIndex]),
                              ),
                            ),
                          ));
                    }),
                  );
                } else if (attemptIndex == guesses.length && !gameOver) {
                  return Row(
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: List.generate(targetGrade.length, (index) {
                      return Container(
                          width: 40,
                          height: 40,
                          margin: const EdgeInsets.only(bottom: 10),
                          decoration: BoxDecoration(
                              border: Border(
                                bottom: const BorderSide(
                                    color: Colors.deepOrangeAccent, width: 2),
                                top: const BorderSide(
                                    color: Colors.deepOrangeAccent, width: 2),
                                left: BorderSide(
                                    color: Colors.deepOrangeAccent,
                                    width: (index == 0) ? 2 : 0.5),
                                right: BorderSide(
                                    color: Colors.deepOrangeAccent,
                                    width: (index == targetGrade.length - 1)
                                        ? 2
                                        : 0.5),
                              ),
                              borderRadius: BorderRadius.horizontal(
                                  left: Radius.circular((index == 0) ? 20 : 0),
                                  right: Radius.circular(
                                      (index == targetGrade.length - 1)
                                          ? 20
                                          : 0))),
                          child: Center(
                            child: Text(
                                index < currentGuess.length
                                    ? currentGuess[index]
                                    : '',
                                style: const TextStyle(
                                    fontWeight: FontWeight.bold)),
                          ));
                    }),
                  );
                } else {
                  return Row(
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: List.generate(targetGrade.length, (index) {
                      return Container(
                        width: 40,
                        height: 40,
                        margin: const EdgeInsets.only(bottom: 10),
                        decoration: BoxDecoration(
                            border: Border(
                              bottom: const BorderSide(
                                  color: Colors.deepOrangeAccent, width: 2),
                              top: const BorderSide(
                                  color: Colors.deepOrangeAccent, width: 2),
                              left: BorderSide(
                                  color: Colors.deepOrangeAccent,
                                  width: (index == 0) ? 2 : 0.5),
                              right: BorderSide(
                                  color: Colors.deepOrangeAccent,
                                  width: (index == targetGrade.length - 1)
                                      ? 2
                                      : 0.5),
                            ),
                            borderRadius: BorderRadius.horizontal(
                                left: Radius.circular((index == 0) ? 20 : 0),
                                right: Radius.circular(
                                    (index == targetGrade.length - 1)
                                        ? 20
                                        : 0))),
                      );
                    }),
                  );
                }
              },
            ),
          ),
          /*
          Padding(
            padding: const EdgeInsets.all(8.0),
            child: Text(
              gameOver
                  ? 'Игра окончена. Марка стали: $targetGrade'
                  : /*'Попытка ${guesses.length + 1} из $maxAttempts'*/ '',
              style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
            ),
          ),  
          */
          Padding(
            padding: const EdgeInsets.all(18.0),
            child: ElevatedButton(
              onPressed: makeGuess,
              style: ElevatedButton.styleFrom(
                padding: const EdgeInsets.all(8),
                minimumSize: Size(40, 40),
                backgroundColor: const Color.fromARGB(
                    255, 245, 222, 165), // Transparent background
                // Remove shadow
                side: const BorderSide(
                  color: Colors.deepOrangeAccent, // Border color
                  width: 2, // Border width
                ),
              ),
              child: Text('Подтвердить',
                  style:
                      TextStyle(fontSize: 14, color: Colors.deepOrangeAccent)),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(16.0),
            child: ConstrainedBox(
              constraints: const BoxConstraints(maxWidth: 420),
              child: Wrap(
                alignment: WrapAlignment.center,
                children:
                    'АВГДЗКМНОПРСТУФХЦШЮ0123456789<'.split('').map((char) {
                  return Padding(
                    padding: const EdgeInsets.all(2.0),
                    child: ElevatedButton(
                      onPressed: () => onCharacterPressed(char),
                      style: ElevatedButton.styleFrom(
                        padding: const EdgeInsets.all(8),
                        minimumSize: Size(40, 40),
                        backgroundColor: const Color.fromARGB(
                            255, 245, 222, 165), // Transparent background

                        side: const BorderSide(
                          color: Colors.deepOrangeAccent, // Border color
                          width: 2, // Border width
                        ),
                      ),
                      child: Text(char,
                          style: TextStyle(
                              color: Colors.deepOrangeAccent, fontSize: 12)),
                    ),
                  );
                }).toList(),
              ),
            ),
          ),
        ],
      ),
    );
  }
}
